app/controllers/knowledges_controller.rb

SELECT `knowledges`.* FROM `knowledges`
---
  def index
    @knowledges = Knowledge.all