app/controllers/md_notes_controller.rb

  def index
    @md_notes = MdNote.all
---
SELECT `md_notes`.* FROM `md_notes`